{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Написать программу «справочник».Создать два списка <br>\n",
    "целых. Один список хранит идентификационные коды, <br>\n",
    "второй — телефонные номера. Реализовать меню для <br>\n",
    "пользователя:<br> \n",
    "■ Отсортировать по идентификационным кодам; <br>\n",
    "■ Отсортировать по номерам телефона; <br>\n",
    "■ Вывести список пользователей с кодами и телефонами; <br>\n",
    "■ Выход."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей с кодами и телефонами\n",
      "4. Выход\n",
      "Список отсортирован по идентификационным кодам.\n",
      "\n",
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей с кодами и телефонами\n",
      "4. Выход\n",
      "Список отсортирован по номерам телефона.\n",
      "\n",
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей с кодами и телефонами\n",
      "4. Выход\n",
      "\n",
      "Список пользователей:\n",
      "ID: 104, Телефон: 111-222-3333\n",
      "ID: 101, Телефон: 123-456-7890\n",
      "ID: 103, Телефон: 555-555-5555\n",
      "ID: 102, Телефон: 987-654-3210\n",
      "\n",
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей с кодами и телефонами\n",
      "4. Выход\n",
      "Выход из программы.\n"
     ]
    }
   ],
   "source": [
    "def display_menu():\n",
    "    print(\"\\nМеню:\")\n",
    "    print(\"1. Отсортировать по идентификационным кодам\")\n",
    "    print(\"2. Отсортировать по номерам телефона\")\n",
    "    print(\"3. Вывести список пользователей с кодами и телефонами\")\n",
    "    print(\"4. Выход\")\n",
    "\n",
    "def sort_by_ids(ids, phones):\n",
    "    combined = list(zip(ids, phones))\n",
    "    combined.sort()  # Сортировка по первому элементу (идентификационные коды)\n",
    "    return zip(*combined)  # Разделяем обратно на два списка\n",
    "\n",
    "def sort_by_phones(ids, phones):\n",
    "    combined = list(zip(ids, phones))\n",
    "    combined.sort(key=lambda x: x[1])  # Сортировка по второму элементу (номера телефонов)\n",
    "    return zip(*combined)  # Разделяем обратно на два списка\n",
    "\n",
    "def main():\n",
    "    ids = [101, 102, 103, 104]\n",
    "    phones = [\"123-456-7890\", \"987-654-3210\", \"555-555-5555\", \"111-222-3333\"]\n",
    "\n",
    "    while True:\n",
    "        display_menu()\n",
    "        choice = input(\"Выберите опцию (1-4): \")\n",
    "\n",
    "        if choice == '1':\n",
    "            ids, phones = sort_by_ids(ids, phones)\n",
    "            print(\"Список отсортирован по идентификационным кодам.\")\n",
    "        elif choice == '2':\n",
    "            ids, phones = sort_by_phones(ids, phones)\n",
    "            print(\"Список отсортирован по номерам телефона.\")\n",
    "        elif choice == '3':\n",
    "            print(\"\\nСписок пользователей:\")\n",
    "            for id, phone in zip(ids, phones):\n",
    "                print(f\"ID: {id}, Телефон: {phone}\")\n",
    "        elif choice == '4':\n",
    "            print(\"Выход из программы.\")\n",
    "            break\n",
    "        else:\n",
    "            print(\"Неверный выбор. Пожалуйста, попробуйте снова.\")\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Меню:\n",
      "1. Отсортировать по названию книг\n",
      "2. Отсортировать по годам выпуска \n",
      "3. Вывести список книг с названиями и годами выпуска\n",
      "4. Выход\n"
     ]
    }
   ],
   "source": [
    "# Задание 2\n",
    "# Написать программу «книги». Создать два списка c данными.Один список хранит названия книг,второй - \n",
    "# годы выпуска. Реализовать меню для пользователя:\n",
    "# ■ Отсортировать по названию книг;\n",
    "# ■ Отсортировать по годам выпуска;\n",
    "# ■ Вывести список книг с названиями и годами выпуска;\n",
    "# ■ Выход;\n",
    "print(\"\\nМеню:\")\n",
    "print(\"1. Отсортировать по названию книг\")\n",
    "print(\"2. Отсортировать по годам выпуска \")\n",
    "print(\"3. Вывести список книг с названиями и годами выпуска\")\n",
    "print(\"4. Выход\")\n",
    "\n",
    "books = ['Книга2', 'Книга1', 'Книга3']\n",
    "books.sort()\n",
    "\n",
    "years = [2020, 1990, 1998]\n",
    "\n",
    "years.sort()\n",
    "\n",
    "while True:\n",
    "    menu = input('Введите опцию 1-4: ')\n",
    "\n",
    "    if menu == '1':\n",
    "        print(books)\n",
    "\n",
    "    elif menu == '2':\n",
    "        print(years)\n",
    "\n",
    "    elif menu == '3':\n",
    "        print('1.', books[0], ':', years[0])\n",
    "        print('2.', books[1], ':', years[1])\n",
    "        print('3.', books[2], ':', years[2])\n",
    "\n",
    "    elif menu == '4':\n",
    "        break\n",
    "    else:\n",
    "        print('Вы ввели что-то другое.')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
